/*Task1:  Напишите программу, которая принимает на вход трёхзначное число и на выходе 
показывает вторую цифру этого числа.*/
/*
int SecondNumber(int number)
{
    return number % 100 / 10;
}

int num;
do
{
    Console.Write("Input a three-digit number: ");
    Int32.TryParse(Console.ReadLine(), out num);
}
while (num <= 99 || num >= 1000);

Console.WriteLine($"From the number {num}, the second digit {SecondNumber(num)}");
*/
// Task2